Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption
The join type of the railing path.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.NoConnector
No connector.

Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.AddVerticalOrHorizontalSegments
Add vertical or horizontal segments.

Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.ExtendRailsToMeet
Extend rails to meet.

Autodesk.Revit.DB.Architecture.RailingPathCurveJoinOption.ByType
The rails will be joined according to the settings in the rail type.